window.sr = ScrollReveal();
sr.reveal('.first',{duration:2000});
sr.reveal('.second',{duration:2000});
sr.reveal('#three',{duration:2000});
sr.reveal('#four',{duration:2000},);
sr.reveal('#five',{duration:2000},);
sr.reveal('#six',{duration:2000},);
sr.reveal('#seven',{duration:2000},);
sr.reveal('#eight',{duration:2000},);
sr.reveal('#nine',{duration:2000},);
sr.reveal('#ten',{duration:2000},);
sr.reveal('#eleven',{duration:2000},);
sr.reveal('#twelve',{duration:2000},);
sr.reveal('#thirteenth',{duration:2000},);
sr.reveal('#fourteenth',{duration:2000},);
sr.reveal('#fifteenth',{duration:2000},);
sr.reveal('#sixteenth',{duration:2000},);
sr.reveal('#eightteenth',{duration:2000},);
sr.reveal('#twenty',{duration:2000},);
sr.reveal('#twentyone',{duration:2000},);
sr.reveal('#twentytwo',{duration:2000},);
sr.reveal('#twentythree',{duration:2000},);
sr.reveal('#twentyfour',{duration:2000},);
sr.reveal('#twentyfive',{duration:2000},);
sr.reveal('#twentysix',{duration:2000},);
sr.reveal('#twentyseven',{duration:2000},);
sr.reveal('.five',{duration:2000});
sr.reveal('.six',{duration:2000});
sr.reveal('.eight',{duration:2000});
sr.reveal('.new',{duration:2000});
sr.reveal('.first-new',{duration:2000});
sr.reveal('.second-col',{duration:2000});
const popper = document.querySelector('.tooltipone');
const factory = document.querySelector('.factory');
const domeny = document.querySelector('.domeny');
const bake = document.querySelector('.bake');
const dsp = document.querySelector('.dsp');
const vacuumer = document.querySelector('.vacuumer');
const vacuumertwo = document.querySelector('.vacuumertwo');
const ingots = document.querySelector('.ingots');
const baketwo = document.querySelector('.baketwo');
const dsptwo = document.querySelector('.dsptwo');
const calibr = document.querySelector('.calibr');
const stanfour = document.querySelector('.stanfour');
const stanthree = document.querySelector('.stanthree');
const staneight = document.querySelector('.staneight');
const car = document.querySelector('.car');
const mnls = document.querySelector('.mnls');
const stanfourtwo = document.querySelector('.stanfourtwo');
const linerepeir = document.querySelector('.linerepeir');
const cartwo= document.querySelector('.cartwo');
const lom= document.querySelector('.lom');
const first_new= document.querySelector('.first-new');
const lom_tool= document.querySelector('.lom-tool');

const instanceLomTool= new Tooltip(lom_tool, {
  placement: 'right',
  title: "Два слова",
});
const instanceFirstNew= new Tooltip(first_new, {
  placement: 'right',
  title: "Два слова",
});
const instanceLrepeir= new Tooltip(linerepeir, {
  placement: 'left',
  title: "Линии финишной отделки круглого и шестигранного проката – комплекс оборудования, который дает возможность выпускать прокат со специальной отделкой поверхности, в том числе обточенный с особо высокой точностью геометрических размеров Линия отделки круглых черных прутков. Правка, кривизна после правки - н/б 1 мм/м (рессорно-пружинные - н/б 1.2 мм/м) Неразрушающий контроль – контроль марки, поверхностные и внутренние дефекты (УЗК) Зачистка или вырезка дефектов - пила Торцовка и снятие фаски под углом 45 или 60 гр. - 0.5-4 +/-0.3 мм Упаковка, обвязка и взвешивание Линия обточки-полировки проката. Точность проката после обработки - h9/h10 Неразрушающий контроль- поверхностные дефекты. Контроль размера - лазерный измеритель Упаковка, обвязка, взвешивание. Линия отделки шестигранных профилей. Правка, кривизна после правки - н/б 1 мм/м (рессорно-пружинные - н/б 1.2 мм/м), скручивание - 0.5 гр./м (3 гр./12 м макс.) Торцовка и снятие фаски под углом 45 или 60 гр. - 0.5-4 +/-0.3 мм Упаковка, обвязка и взвешивание",
});
const instanceLom= new Tooltip(lom, {
  placement: 'left',
  title: "Ломом на заводы поступает с предприятий «УГМК-Холдинга»",
});
const instance= new Tooltip(popper, {
  placement: 'left',
  title: "Для производства (применяются) \"железорудные\" материалы концентрат железорудный шахты Северопесчанская ОА Богословское рудоуправление концентрат железный производства ОАО Святогор, флюсы известняк ОАО Севуралбокситруда, известь, обожженная собственного производства твердое топливо кокс мелочь коксовая тощий каменный уголь",
});
const instanceFourtwo= new Tooltip(stanfourtwo, {
  placement: 'left',
  title: "Стан линейного типа, имеет в своем составе обжимную нереверсивную клеть 680 трио и линейно расположенные четыре клети 450 в чистовой линии. Нагрев передельной заготовки до температуры прокатки производится в двух методических печах толкательного типа. Печи имеют три зоны: томильная зона, сварочная зона с верхним и нижним подогревом, методическая зона. Печи отапливаются природным газом. Движение заготовки осуществляется по глиссажным водоохлаждаемым трубам. Резка проката выполняется двумя салазковыми пилами. Охлаждение проката выполняется на двух реечных цепных холодильниках. Сортамент стана: товарный прокат и подкат для калибровочного производства. - прокат круглого сечения диаметром от 32 до 120 мм - прокат шестигранного сечения диаметром вписанного круга от 32 до 75 мм - прокат квадратного сечения со стороной от 40 до 110 мм - пустотелый прокат круглого сечения диаметром от 26,5 до 41,0 мм и шестигранного сечения диаметром вписанного круга от 24 до 38 мм Годовой объем производства – 255 400 тонн.",
});
const instanceMnls= new Tooltip(mnls, {
  placement: 'right',
  title: "Жидкая сталь разливается на МНЛЗ открытой или закрытой струей на заготовку размером 150х150(130х130) мм длиной 6-12 м с электромагнитным перемешиванием в кристаллизаторе и ручьях. Заготовка при необходимости проходит дробеструйную очистку от окалины, магнитно-порошковый контроль поверхностных дефектов и их абразивную сплошную или выборочную зачистку. Количество ручьев - 4 шт. Радиус машины - 9 м Номинальная емкость промковша - 18.4 т (макс. 19.8 т) Оснащен манипуляторами для защитной трубы и для разливочного стакана. Контроль уровня стали в кристаллизаторе - радиоактивный датчик Со60.",
});
const instanceF= new Tooltip(factory, {
  placement: 'left',
  title: "Ввод в эксплуатацию – 1946 г. Работает в составе двух агломашин площадью спекания 30 и 50 м2. Производится агломерат для доменного цеха. Основные задачи цеха: производство агломерата для доменного цеха; производство обожженной извести для нужд ЭСПЦ; Максимальный годовой объем производства: 660 тыс. тонн агломерата 14,6 тыс. тонн извести"
});
const instanceD= new Tooltip(domeny, {
  placement: 'right',
  title: "Ввод в эксплуатацию – 1896 г. Работает в составе трех печей объемом 205, 212 и 260 м3,обеспечивает жидким передельным чугуном электросталеплавильный цех, производит товарный передельный литейный чугун в чушках. Основные задачи цеха: производство передельного чугуна для электросталеплавильного цеха; производство чугуна литейному цеху для отливки изложниц и другого чугунного литья; производство товарного чугуна; производство граншлака; производство доменного газа. Максимальный годовой объем производства: 365 тыс. тонн чугуна; 115 тыс. тонн граншлака. "
});
const instanceB= new Tooltip(bake, {
  placement: 'left',
  title: "АКП (агрегат печь-ковш) служит для доведения полупродукта, выпущенного из ДСП-80 до заданной температуры и химического состава готовой стали, для последующей обработки на вакууматоре (при необходимости) и разливки на МНЛЗ. Емкость ковша – 80 т Годовой объем производства 750 000 т Время плавки 35-47 минут"
});
const instanceDsp= new Tooltip(dsp, {
  placement: 'right',
  title: "Предназначена для выплавки полупродукта с заданной температурой для последующей обработки и легирования. Емкость печи – 80 т Годовой объем производства – 750 000 т Время плавки – 47 минут Используемая шихта – до 40% жидкого чугуна или 100% металлолома"
});
const instanceBt= new Tooltip(baketwo, {
  placement: 'left',
  title: "АКП (агрегат печь-ковш) служит для доведения полупродукта, выпущенного из ДСП-80 до заданной температуры и химического состава готовой стали, для последующей обработки на вакууматоре (при необходимости) и разливки на МНЛЗ. Емкость ковша – 80 т Годовой объем производства 750 000 т Время плавки 35-47 минут"
});
const instanceDspt= new Tooltip(dsptwo, {
  placement: 'right',
  title: "Предназначена для выплавки полупродукта с заданной температурой для последующей обработки и легирования. Емкость печи – 80 т Годовой объем производства – 750 000 т Время плавки – 47 минут Используемая шихта – до 40% жидкого чугуна или 100% металлолома"
});
const instanceV= new Tooltip(vacuumer, {
  placement: 'left',
  title: "Служит для обработки жидкой стали под вакуумом с целью улучшения её качества за счёт уменьшения в ней содержания газов (водород, кислород) и неметаллических включений. Емкость в ковше по вакуумирование – 75 т Тип агрегата – камерный VD Время обработки – до 45 минут"
});
const instanceVtwo= new Tooltip(vacuumertwo, {
  placement: 'left',
  title: "Служит для обработки жидкой стали под вакуумом с целью улучшения её качества за счёт уменьшения в ней содержания газов (водород, кислород) и неметаллических включений. Емкость в ковше по вакуумирование – 75 т Тип агрегата – камерный VD Время обработки – до 45 минут"
});
const instanceI= new Tooltip(ingots, {
  placement: 'right',
  title: "Сталь разливается в слитки сифонным способом. Слитки имеют конусную форму в продольном сечении (с расширением кверху) и квадратную - в поперечном сечении с вогнутыми гранями и скругленными углами для снижения напряжений и возникновения разрывов при кристаллизации стали. Помимо основной части, слиток содержит прибыльную часть - дополнительное удлинение для локализации выделяющихся газов и всплывающих неметаллических включений. Прибыльная часть слитка имеет обратную конусность (с расширением вниз), которая удаляется после прокатки слитков. Разливают слитки массой: 5,2, 5,3, 5,6, 5,7 тонн. Разливка стали в слитки имеет ряд преимуществ перед распространенной в настоящее время непрерывной разливкой на МНЛЗ: Преимущества: - возможность быстрой смены марочного сортамента выплавляемой и разливаемой стали; - наличие чистой центральной части слитка (дендритной зоны) по содержанию неметаллических включений."
});
const instanceC= new Tooltip(calibr, {
  placement: 'right',
  title: "Ввод в эксплуатацию – 1933 г. В состав калибровочного цеха входят участки отделки, зачистки, термообработки металла, отделения волочения, травильное и инструментальное, другие подразделения. Цех оборудован отечественными и импортными станками и линиями для холодного волочения проката, обточки и полировки. Основные задачи цеха: производство калиброванного, горячекатаного проката и проката со специальной отделкой поверхности. Максимальная годовая производительность: 90 тыс. тонн калиброванного металлопроката"
});
const instanceStan= new Tooltip(stanfour, {
  placement: 'left',
  title: "Стан линейного типа, имеет в своем составе обжимную нереверсивную клеть 680 трио и линейно расположенные четыре клети 450 в чистовой линии. Нагрев передельной заготовки до температуры прокатки производится в двух методических печах толкательного типа. Печи имеют три зоны: томильная зона, сварочная зона с верхним и нижним подогревом, методическая зона. Печи отапливаются природным газом. Движение заготовки осуществляется по глиссажным водоохлаждаемым трубам. Резка проката выполняется двумя салазковыми пилами. Охлаждение проката выполняется на двух реечных цепных холодильниках. Сортамент стана: товарный прокат и подкат для калибровочного производства. - прокат круглого сечения диаметром от 32 до 120 мм - прокат шестигранного сечения диаметром вписанного круга от 32 до 75 мм - прокат квадратного сечения со стороной от 40 до 110 мм - пустотелый прокат круглого сечения диаметром от 26,5 до 41,0 мм и шестигранного сечения диаметром вписанного круга от 24 до 38 мм Годовой объем производства – 255 400 тонн."
});
const instanceStanThree= new Tooltip(stanthree, {
  placement: 'left',
  title: "Стан линейно-непрерывного типа, имеющий в своем составе обжимную клеть 550 нереверсивную трио, три клети в линейной промежуточной группе, две петлевые клети, четыре непрерывные клети. Нагрев передельной заготовки осуществляется в методической толкательной печи. Печи имеют три зоны: томильная зона, сварочная зона с верхним и нижним подогревом, методическая зона. Печи отапливается природным газом. Движение заготовки осуществляется по глиссажным водоохлаждаемым трубам. Охлаждение проката выполняется на реечном холодильнике длиной 48 м шириной 15 м. Резка проката на требуемую длину по заказу выполняется на прессе усилием 500тонн. Отделка проката осуществляется на адъюстаже, где выполняется правка, осмотр, зачистка, контроль, упаковка металлопроката с дальнейшей отгрузкой потребителю. Сортамент стана: товарный прокат и подкат для калибровочного производства: - прокат круглого сечения диаметром от 10 до 36 мм включ.; - шестигранного сечения диаметром вписанного круга от 10 до 32 мм включ.; - квадратного сечения со стороной от 12 до 24 мм включ.; - арматурный прокат гладкого и периодического профиля от 10 до 28. Длина проката до 11700 мм. Годовой объем производства– 127 100 тонн. "
});
const instanceStanEight= new Tooltip(staneight, {
  placement: 'right',
  title: "Линейный реверсивный стан, состоит из трёх клетей – обжимная, черновая, чистовая. Для нагрева слитков до температуры прокатки имеется шесть групп одноместных регенеративных нагревательных колодцев с общим количеством ячеек 147. Отопление колодцев производится смесью доменного и природного газов. Резка раскатов проката выполняется пилами ударного действия с ременным приводом режущего диска модели РР-2000. Выполняется резка полного сортамента проката круглого сечения диаметром от 140 до 300 мм включ., резка проката квадратного сечения со стороной от 130 до 220 мм включ. Охлаждение проката выполняется на воздухе или термосах замедленного охлаждения. Транспортировка проката для охлаждения выполняется мостовыми кранами, оборудованных механизированными клещами для транспортировки проката. Обработка металлопроката выполняется на адъюстаже цеха, имеющим в составе участок обработки передельной заготовки и участки обработки товарного проката. Продукция: товарный прокат и трубная заготовкаsдиаметром от 140 до 300 мм, осевая заготовка квадратного сечения со стороной 215 и 230 мм, товарна заготовка квадратного сечения со стороной от 150 до 220 мм, передельная заготовка квадратного сечения со стороной 130, 140, 170, 180, 184 мм. Годовой объем производства – 628 050 тонн. "
});
const instanceCar= new Tooltip(car, {
  placement: 'left',
  title: "УГМК-Сталь организует комплексные поставки, используя железнодорожную сеть и автотранспорт Пачки прутков маркируются двумя пластиковыми ярлыками, содержащие следующую информацию: товарный знак и наименование предприятия изготовителя; НТД; номинальный размер, марку стали, номер плавки, длину порезки, вес пакета, номер пакета и дату производства. Упаковка производится в соответствии с ГОСТ 7566-94. "
});
const instanceCartwo= new Tooltip(cartwo, {
  placement: 'bottom',
  title: "УГМК-Сталь организует комплексные поставки, используя железнодорожную сеть и автотранспорт Пачки прутков маркируются двумя пластиковыми ярлыками, содержащие следующую информацию: товарный знак и наименование предприятия изготовителя; НТД; номинальный размер, марку стали, номер плавки, длину порезки, вес пакета, номер пакета и дату производства. Упаковка производится в соответствии с ГОСТ 7566-94. "
});
if (document.body.clientWidth<=768){
  instance.updateTitleContent('Два слова')
  instanceLrepeir.updateTitleContent('Два слова')
  instanceCartwo.updateTitleContent('Два слова')
  instanceCar.updateTitleContent('Два слова')
  instanceStanEight.updateTitleContent('Два слова')
  instanceStanThree.updateTitleContent('Два слова')
  instanceStan.updateTitleContent('Два слова')
  instanceC.updateTitleContent('Два слова')
  instanceI.updateTitleContent('Два слова')
  instanceLom.updateTitleContent('Два слова')
  instanceFourtwo.updateTitleContent('Два слова')
  instanceMnls.updateTitleContent('Два слова')
  instanceF.updateTitleContent('Два слова')
  instanceD.updateTitleContent('Два слова')
  instanceB.updateTitleContent('Два слова')
  instanceDsp.updateTitleContent('Два слова')
  instanceBt.updateTitleContent('Два слова')
  instanceV.updateTitleContent('Два слова')
  instanceVtwo.updateTitleContent('Два слова')
  instanceDspt.updateTitleContent('Два слова')
}
